// Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.

void TakeNum(int [] num)
{
    if ( num = 5)
    {
        if ((num[0]==num[4])&&(num[1]==num[3]))
        {
            Console.WriteLine("yes");
        }
        else
        {
            Console.WriteLine("no");
        }
    }
}
TakeNum(12821);