// 2.Напишите программу, которая будет выдавать название дня недели 
// по заданному номеру
Console.WriteLine("Введите число дня недели");
string s_a = Console.ReadLine()!;

if (s_a == "1")
{
    Console.WriteLine("ПН");
}

else if (s_a == "2")
{
    Console.WriteLine("ВТ");
}

else if (s_a == "3")
{
    Console.WriteLine("СР");
}

else if (s_a == "4")
{
    Console.WriteLine("ЧТ");
}

else if (s_a == "5")
{
    Console.WriteLine("ПТ");
}

else if (s_a == "6")
{
    Console.WriteLine("СБ");
}

else if (s_a == "7")
{
    Console.WriteLine("ВС");
}

else
{
    Console.WriteLine("ERROR");
}