// 0. Напишите программу, которая на вход принимает число 
// выдает его кввадрат (число умноженное само на себя)

// string s_a = Console.ReadLine()!;

int a = int.Parse(Console.ReadLine()!);

Console.WriteLine(a * a);
