// Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
Console.WriteLine("Введите число дня недели");
string s_a = Console.ReadLine()!;

if (s_a == "1")
{
    Console.WriteLine("нет");
}

else if (s_a == "2")
{
    Console.WriteLine("нет");
}

else if (s_a == "3")
{
    Console.WriteLine("нет");
}

else if (s_a == "4")
{
    Console.WriteLine("нет");
}

else if (s_a == "5")
{
    Console.WriteLine("нет");
}

else if (s_a == "6")
{
    Console.WriteLine("да");
}

else if (s_a == "7")
{
    Console.WriteLine("да");
}

else
{
    Console.WriteLine("ERROR");
}
